jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1700_DFP.2.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC1700_DFP</name>
  <description>NXP LPC1700 Series Device Support, Drivers and Examples for MCB1700 and LPC1788-32</description>

  <releases>
    <release version="2.1.0" date="2015-06-19">
      Added full support for LPC177x/8x devices:
      -- CMSIS and Peripheral drivers
      -- Board support and examples for Embedded Artists LPC1788-32 DK
      -- External Memory Controller configuration in system file
      Added new CMSIS drivers:
      -- SAI/I2S driver
      -- MCI driver for LPC177x/8x devices
      Updated CMSIS drivers:
      - Driver configuration (RTE_Device.h): added support for new drivers and LPC177x/8x devices
      - I2C, EMAC, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - SPI, USART: Corrected status bit-field race conditions
      - SPI: corrected ARM_SPI_EVENT_DATA_LOST event handling in slave mode
      - EMAC:
      -- corrected return value of PHY_Read function
      -- GetMacAddress function implemented
      -- corrected MDC clock divider setting for Ethernet PHY
      -- corrected no communication after cable reconnected
      - USART:
      -- corrected disabling of receive DMA channel when aborting Receive or Transfer
      -- fract_div_lookup_table moved from header file to driver .c file
      -- improved baudrate calculation
      -- corrected RX Time-out handling
      -- corrected USART clock configuration
      - USB Device:
      -- added support for LPC177x/8x devices
      -- added support for isochronous endpoints
      - USB Host:
      -- added support for LPC177x/8x devices
      Updated SVD file for LPC175x/6x: corrected USB base address
      Updated drivers:
      - PIN: added support for LPC177x/8x devices
      - GPDMA: added GPDMA_ChannelGetCount function
      - OTG: added support for LPC177x/8x devices
      Updated examples for Keil MCB1700 Board
    </release>
    <release version="2.0.0" date="2014-07-09">
      - Added CMSIS-Driver 2.02 compliant drivers for LPC175x and LPC176x Device Series
      - Added MDK-Middleware examples for MCB1700 Development Board (requires MDK-Middleware Pack 6.1.0 or higher)
    </release>
    <release version="1.0.2">
      Renamed Device Sub-Families.
    </release>
    <release version="1.0.1">
      MCB1700 added.
    </release>
    <release version="1.0.0">
      First Release version of LPC1700 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC1700</keyword>
    <keyword>LPC17xx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="LPC1700 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <book    name="Documents\dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
NXP's LPC1700 series are high performance MCUs for embedded applications featuring a high level of integration and low power consumption.
Typical applications include eMetering, Lighting, Industrial networking, Alarm systems, White goods and Motor control.

  - Quadrature Encoder interface,
  - Motor control PWM for three-phase motor
  - 2-input plus 2-output I2S-bus interface
  - Code Read Protection (CRP) with different security levels.
  - Unique device serial number
        </description>

        <feature type="Timer"         n="4"       m="32"/>


      <!-- ************************  Subfamily 'LPC175x'  **************************** -->
      <subFamily DsubFamily="LPC175x">
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="IOs"           n="52"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="2"                           name="SSP"/>
        <feature type="USART"         n="4"/>
        <feature type="USBD"          n="1"/>
      
      <!-- *************************  Device 'LPC1751'  ***************************** -->
      <device Dname="LPC1751">
        <processor Dclock="100000000"/>
        <compile header="Device\Include\LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD\LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents\LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1752'  ***************************** -->
      <device Dname="LPC1752">
        <processor Dclock="100000000"/>
        <compile header="Device\Include\LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD\LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents\LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1754'  ***************************** -->
      <device Dname="LPC1754">
        <processor Dclock="100000000"/>
        <compile header="Device\Include\LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD\LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents\LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1756'  ***************************** -->
      <device Dname="LPC1756">
        <processor Dclock="100000000"/>
        <compile header="Device\Include\LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD\LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents\LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
      </device>
      
      <!-- *************************  Device 'LPC1758'  ***************************** -->
      <device Dname="LPC1758">
        <processor Dclock="100000000"/>
        <compile header="Device\Include\LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD\LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents\LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
