jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1700_DFP.2.1.0.pdsc
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC17xx CMSIS Device ARMCC">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC1700 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC17XX      /* Device Startup for NXP17XX */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- header files -->
        <file category="header" condition="LPC175x" name="Device\Include\LPC17xx.h"/>
        <file category="header" condition="LPC176x" name="Device\Include\LPC17xx.h"/>
        <file category="header" condition="LPC177x" name="Device\Include\LPC177x_8x.h"/>
        <file category="header" condition="LPC178x" name="Device\Include\LPC177x_8x.h"/>

        <!-- startup files -->
        <file category="source" condition="LPC175x" name="Device\Source\ARM\startup_LPC17xx.s"      attr="config" version="1.0.0"/>
        <file category="source" condition="LPC176x" name="Device\Source\ARM\startup_LPC17xx.s"      attr="config" version="1.0.0"/>
        <file category="source" condition="LPC177x" name="Device\Source\ARM\startup_LPC177x_8x.s"   attr="config" version="1.0.0"/>
        <file category="source" condition="LPC178x" name="Device\Source\ARM\startup_LPC177x_8x.s"   attr="config" version="1.0.0"/>

        <!-- system file -->
        <file category="source" condition="LPC175x" name="Device\Source\system_LPC17xx.c"           attr="config" version="1.0.0"/>
        <file category="source" condition="LPC176x" name="Device\Source\system_LPC17xx.c"           attr="config" version="1.0.0"/>
        <file category="source" condition="LPC177x" name="Device\Source\system_LPC177x_8x.c"        attr="config" version="1.0.0"/>
        <file category="source" condition="LPC178x" name="Device\Source\system_LPC177x_8x.c"        attr="config" version="1.0.0"/>

        <!-- device configuration for LPC17xx -->
        <file category="header" condition="LPC1700 CMSIS Device" name="RTE_Driver\Config\RTE_Device.h" attr="config" version="2.2.0"/>

        <!-- device configuration for LPC177x_8x -->
        <file category="header" condition="LPC177x_8x CMSIS Device" name="RTE_Driver\Config_LPC177x_8x\RTE_Device.h" attr="config" version="2.2.0"/>

      </files>
    </component>

    <component Cclass="Device" Cgroup="PIN" Cversion="1.0" condition="LPC1700 CMSIS Device">
      <description>Pin Connect driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver\PIN_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\PIN_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="PIN" Cversion="1.0" condition="LPC177x_8x CMSIS Device">
      <description>Pin Connect driver used by RTE Drivers for LPC177x_8x Series</description>
      <files>
        <file category="header" name="RTE_Driver\PIN_LPC177x_8x.h"/>
        <file category="source" name="RTE_Driver\PIN_LPC177x_8x.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.1" condition="LPC1700 CMSIS Device">
      <description>GPIO driver used by RTE Drivers for LPC17xx Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\GPIO_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.1" condition="LPC177x_8x CMSIS Device">
      <description>GPIO driver used by RTE Drivers for LPC17xx Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\GPIO_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.2" condition="LPC17xx CMSIS Device">
      <description>GPDMA driver used by RTE Drivers for LPC1700 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPDMA_LPC17xx.h"/>
        <file category="source" name="RTE_Driver\GPDMA_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="2.3" condition="LPC17xx USBD">
      <description>USB Device Driver for the LPC17xx series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBD_LPC17xx.c"/>
        <file category="source" name="RTE_Driver\OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.1" Cversion="2.2" condition="LPC17xx USBH">
      <description>USB OHCI Host Driver for the LPC17xx series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBH_LPC17xx.c"/>
        <file category="source" name="RTE_Driver\OTG_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1" Cversion="2.3" condition="LPC1700 CMSIS PIN GPIO">
      <description>SPI Driver for LPC17xx Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SSP_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="SSP" Capiversion="2.1" Cversion="2.3" condition="LPC177x_8x CMSIS PIN GPIO">
      <description>SPI Driver for LPC177x_8x Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SSP_LPC17xx.c"/>
      </files>
    </component>
