jack77er/openUTRUSTA/Packages/.cache/Keil.LPC1700_DFP.2.1.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="2.3" condition="LPC17xx CMSIS PIN">
      <description>I2C Driver for LPC17xx Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0" Cversion="1.0" condition="LPC17xx CMSIS PIN">
      <description>I2C Driver for LPC17xx Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SAI0                /* Driver SAI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2S_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.3" condition="LPC1700 CMSIS PIN">
      <description>UART Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.3" condition="LPC177x_8x CMSIS PIN">
      <description>UART Driver for LPC177x_8x Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.7" condition="LPC17xx Ethernet">
      <description>Ethernet MAC Driver for LPC1700 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\EMAC_LPC17xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="1.1" condition="LPC177x_8x CMSIS PIN GPIO GPDMA">
      <description>MCI Driver for LPC177x_8x Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\MCI_LPC177x_8x.c"/>
      </files>
    </component>

    <!-- MCB1700 Development Board -->
    <bundle Cbundle="MCB1700" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB1700</description>
      <doc>Documents\mcb1700.chm</doc>
      <component Cgroup="A/D Converter" condition="LPC1700 CMSIS PIN">
        <description>A/D Converter interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\ADC_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="LPC1700 CMSIS PIN GPIO">
      <description>LED driver for Keil MCB1700 Development Board</description>
        <files>
        <file category="source" name="Boards\Keil\MCB1700\Common\LED_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="LPC1700 CMSIS PIN GPIO">
        <description>Buttons interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\Buttons_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="LPC1700 CMSIS PIN GPIO">
        <description>Joystick interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\Joystick_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" condition="LPC1700 CMSIS PIN GPIO SPI">
        <description>Graphic LCD interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCB1700\Common\GLCD_Config.h"/>
          <file category="source" name="Boards\Keil\MCB1700\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\Keil\MCB1700\Common\GLCD_MCB1700.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="SPI IF" condition="LPC1700 CMSIS PIN GPIO SPI Display">
        <description>emWin LCD SPI Interface for Keil MCB1700 Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCB1700\Common\LCD_X.c"/>
        </files>
      </component>
    </bundle>
    <!-- LPC1788-32 Developers Kit -->
    <bundle Cbundle="LPC1788-32 Developers Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>Embedded Artists LPC1788-32 Developers Kit</description>
      <doc>Documents\mcb1700.chm</doc>
      <component Cgroup="A/D Converter" condition="LPC177x_8x CMSIS PIN">
        <description>A/D Converter interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\ADC_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="LPC177x_8x CMSIS PIN I2C">
      <description>LED driver for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
        <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\LED_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="LPC177x_8x CMSIS PIN I2C">
        <description>Buttons interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\Buttons_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="LPC177x_8x CMSIS PIN GPIO">
        <description>Joystick interface for Embedded Artists LPC1788-32 Developers Kit</description>
        <files>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\Joystick_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Cvariant="TFT 800x480" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "7 inch TFT 800x480" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_800x480
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Config.h"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Cvariant="TFT 480x272" condition="LPC177x_8x CMSIS PIN GPIO I2C">
        <description>LCD Board rev PB1 "4.3 inch TFT 480x272" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_480x272
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Config.h"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Cvariant="TFT 320x240" condition="LPC177x_8x CMSIS PIN GPIO SPI">
        <description>LCD Board rev PB1 "3.2 inch TFT 320x240" for Embedded Artists LPC1788-32 Developers Kit</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_EA_LCD_TFT_320x240
        </RTE_Components_h>
        <files>
          <file category="header" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Config.h"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_Fonts.c"/>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common\GLCD_EA_LPC1788.c"/>
        </files>
      </component>
      <component Cgroup="Audio" condition="LPC177x_8x CMSIS I2C SAI">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards\Embedded Artists\LPC1788-32 Developers Kit\Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>

  </components>
</package>
